     D Msg             S             12
     C                   Eval      Msg  = 'Hello World!'
     C                   CALL      'JFake'
     C                   PARM                    Msg   
     C                   SETON                                        LR

