     D Msg             S             12
     C                   Eval      Msg  = 'RPGCALLER is calling RPGCALLED!'
     C                   dsply                   Msg
     C                   CALL      'RPGCALLED'
     C                   SETON                                          LR
