     D Msg             S             12
     C                   Eval      Msg  = 'Hello World from RPGCALLED'
     C                   dsply                   Msg
     C                   SETON                                          LR
